// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
Console.Clear();
int a = -9;
int b = -3;
if (b > a) Console.WriteLine("b = max, a = min");
else Console.WriteLine("a = max, b = min");